app/views/comments/_comments.html.erb

<hr/>
<% @tweet.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tweet_id" = ?  [["tweet_id", 4]]