app/controllers/posts_controller.rb

  def create
    # render plain: params[:post].inspect
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["body", "test"], ["created_at", "2020-07-29 22:44:40.766754"], ["updated_at", "2020-07-29 22:44:40.766754"]]