app/controllers/tweets_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO "tweets" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "test"], ["created_at", "2020-08-04 00:23:38.490464"], ["updated_at", "2020-08-04 00:23:38.490464"]]
---
  def create
    # render plain: params[:tweet].inspect
    @tweet = Tweet.new(post_params)

    if @tweet.save